Repository: nickguletskii/WixWPFWizardBA
Catalog: WixWPFWizardBA/Localisation.*.resx
Languages: ru_ru

# AdvancedConfigurationPage_AdditionalSqlServerInstallParameters
source: Additional SQL Server installation parameters
ru_ru: Доп. настройки установки SQL Server

# AdvancedConfigurationPage_HideAdvancedSettingsCheckbox
source: Use recommended settings
ru_ru: Использовать рекомендованные настройки

# AdvancedConfigurationPage_InstallationPathLabel
source: Installation path for {0}
ru_ru: Путь установки {0}

# BootrapperUpdateCheckPage_CheckingForUpdatesMessage
source: Checking for updates...
ru_ru: Идет проверка на наличие обновлений установщика...

# BootstrapperManager_InstallErrorMessageTitle
source: {0} - Error while installing
ru_ru: {0} - Ошибка при уставновке

# BootstrapperManager_NewerVersionInstalledMessage
source: A newer version of is {0} already installed
ru_ru: Более новая версия {0} уже установлена.

# BootstrapperManager_NewerVersionInstalledTitle
source: {0} - Newer version already installed
ru_ru: {0} - Установка - Более новая версия

# BootstrapperUpdateAvailablePage_DownloadNewInstallerButtonText
source: Download new installer
ru_ru: Скачать новый установщик

# BootstrapperUpdateAvailablePage_NewInstallerAvailableMessage
source: A new version of the installer for {0} is available.
ru_ru: Доступен более новый установщик {0}.

# BootstrapperUpdateAvailablePage_RunNewInstallerButtonText
source: Run new installer
ru_ru: Запустить новый установщик

# BrowseButtonText
source: Browse
ru_ru: Выбрать

# CancelAlreadyInProgressMessageBoxBody
source: Cancellation is already in progress.
ru_ru: Установка уже отменяется.

# CancelAlreadyInProgressMessageBoxTitle
source: {0} - Setup
ru_ru: {0} - Установка

# CancelDialogBody
source: Are you sure you want to cancel the installation of {0}?
ru_ru: Вы уверены, что хотите отменить установку {0}?

# CancelDialogTitle
source: {0} - Setup
ru_ru: {0} - Установка

# CancelUnavailableMessageBoxBody
source: Can't cancel the installation at this stage.
ru_ru: На данный момент невозможно отменить установку.

# CancelUnavailableMessageBoxTitle
source: {0} - Setup
ru_ru: {0} - Установка

# ConfigurationPage_AdditionalServerSettingsHeader
source: Additional settings
ru_ru: Дополнительные настройки

# ConfigurationPage_InstallationTypeClient
source: Client only
ru_ru: Установить только клиент

# ConfigurationPage_InstallationTypeClientDescription
source: Only the client will be installed. A server will have to be installed on a different computer on the network.
ru_ru: Выберите этот пункт, если в локальной сети уже установлен главный сервер.

# ConfigurationPage_InstallationTypeServer
source: Client and server
ru_ru: Установить сервер и клиент

# ConfigurationPage_InstallationTypeServerDescription
source: Both the client and the server will be installed.
ru_ru: На этот компьютер будет установлен как сам клиент, так и всё программное обеспечение, нужное для работы клиентов в локальной (или виртуальной) сети.

# ConfigurationPage_SqlServerInstanceNameTextBoxLabel
source: Instance name:
ru_ru: Имя экземпляра SQL Server Express

# ConfigurationPage_SqlServerPatchWillBePerformedMessage
source: SQL Server 2014 R2 Express with Advanced Services will be patched.
ru_ru: Более старая версия SQL Server 2014 будет обновлена до SQL Server Express 2014 R2 с дополнительными сервисами.

# ConfigurationPage_SqlServerUnknownInstallationStateMessage
source: Unknown SQL Server installation state.
ru_ru: Не удалось понять, какие действия нужно предпринять, чтобы привести SQL Server в требуемое состояние. Пожалуйста, установите SQL Server вручную.

# ConfigurationPage_SqlServerWillBeInstalledMessage
source: SQL Server 2014 R2 Express with Advanced Services will be installed on this computer.
ru_ru: SQL Server Express 2014 R2 с дополнительными сервисами будет установлен.

# ConfigurationPage_SqlServerWillBeUpgradedMessage
source: An existing installation of SQL Server will be upgraded to SQL Server 2014 R2 Express with Advanced Services.
ru_ru: Более старая версия SQL Server будет обновлена до SQL Server Express 2014 R2 с дополнительными сервисами.

# FinishErrorPage_FinishErrorCanceled
source: The installation was cancelled.
ru_ru: Установка была отменена.

# FinishErrorPage_FinishErrorConnectionError
source: Internet connection error.
ru_ru: Ошибка подключения к сети. Для установки требуется подключение к интернету.

# FinishErrorPage_FinishErrorCouldntDownloadInstallPackages
source: Couldn't download additional packages from the internet.
ru_ru: Ошибка получения установочных пакетов. Проверьте ваше соединение с интернетом.

# FinishErrorPage_FinishErrorCouldntRetrieveInstallPackages
source: Couldn't retrieve additional packages.
ru_ru: Ошибка получения установочных пакетов.

# FinishErrorPage_FinishErrorUnknown
source: An error has occurred, status code: 0x{0:X8}
ru_ru: Во время установки произошла ошибка. Статус: 0x{0:X8}

# FinishPage_ExitButtonText
source: Exit
ru_ru: Выйти

# FinishPage_InstallationFinishedSuccessfully
source: {0} has been successfully installed.
ru_ru: Установка {0} завершена успешно.

# FinishPage_LayoutFinishedSuccessfully
source: An offline installer for {0} has been created successfully.
ru_ru: Создание оффлайн-установщика {0} завершено успешно.

# FinishPage_ModificationFinishedSuccessfully
source: {0} has been successfully modified.
ru_ru: Изменение компонентов {0} завершено успешно.

# FinishPage_RebootButtonText
source: Reboot now
ru_ru: Перезагрузить

# FinishPage_RepairFinishedSuccessfully
source: {0} has been successfully repaired.
ru_ru: Починка {0} завершена успешно.

# FinishPage_RestartRequired
source: To complete the installation, the computer must be rebooted.
ru_ru: Пожалуйста, перезагрузите ваш компьютер, чтобы закончить установку.

# FinishPage_UninstallFinishedSuccessfully
source: {0} has been successfully removed.
ru_ru: Удаление {0} завершено успешно.

# InstallButtonText
source: Install
ru_ru: Установить

# LayoutConfigurationPage_LayoutPathLabel
source: Please select a directory to save the complete installer for {0} to:
ru_ru: Путь к папке, куда сохранить установщик {0}

# LicensePage_AcceptLicenseAgreementCheckboxText
source: I accept the license agreement
ru_ru: Я принимаю условия Лицензионного договора

# PackageConfiguration_PackageList_SQL_Server_2014_with_Advanced_Services__32_bit_
source: SQL Server 2014 with Advanced Services (32-bit)
ru_ru: SQL Server 2014 with Advanced Services (32-битный)

source: SQL Server 2014 with Advanced Services (32-bit) patch
ru_ru: SQL Server 2014 with Advanced Services (32-битный) (патч)

# PackageConfiguration_PackageList_SQL_Server_2014_with_Advanced_Services__64_bit_
source: SQL Server 2014 with Advanced Services (64-bit)
ru_ru: SQL Server 2014 with Advanced Services (64-битный)

source: SQL Server 2014 with Advanced Services (64-bit) patch
ru_ru: SQL Server 2014 with Advanced Services (64-битный) (патч)

source: Upgrade to SQL Server 2014 with Advanced Services (32-bit)
ru_ru: Обновление до SQL Server 2014 with Advanced Services (32-bit)

source: Upgrade to SQL Server 2014 with Advanced Services (64-bit)
ru_ru: Обновление до SQL Server 2014 with Advanced Services (64-bit)

# PlanPage_PlanningMessage
source: Planning installation of {0}...
ru_ru: Идет планировка установки {0}...

# ProgressPage_CachingTextMain
source: Caching WixWPFWizardBA installation files on the local computer...
ru_ru: Идет кэширование компонентов WixWPFWizardBA на диск!

# ProgressPage_InstallingComponentsTextMain
source: Installing additional components.
ru_ru: Идет установка компонентов WixWPFWizardBA!

# ProgressPage_InstallingTextDontTurnOffComputer
source: Please don't turn off the computer. Doing so may result in damage to the operating system.
ru_ru: Не выключайте компьютер.

# ProgressPage_InstallingTextLine1
source: This process may take from several seconds to several hours to complete.
ru_ru: В зависимости от устанавливаемых компонентов и параметров вашего компьютера, установка может занять от нескольких секунд до пары часов.

# ProgressPage_InstallingTextLine2
source: Missing components will be downloaded from the internet automatically.
ru_ru: Недостающие компоненты будут скачаны из интернета автоматически.

# ProgressPage_InstallingTextMain
source: Installing WixWPFWizardBA.
ru_ru: Идет установка WixWPFWizardBA.

# ProgressPage_LayoutInProgressTextMain
source: Creating an offline installer for WixWPFWizardBA.
ru_ru: Идет подготовка к оффлайн-установке WixWPFWizardBA.

# ProgressPage_LayoutInProgressTextMayTakeSomeTime
source: This can take some time, depending on the parameters of your internet connection.
ru_ru: Это может занять много времени, в зависимости от параметров подключения.

# ProgressPage_ProgressCachingEntryText
source: Caching "{0}"
ru_ru: Кэширование "{0}"

# ProgressPage_ProgressCopyEntryText
source: Copying "{0}"
ru_ru: Копирование "{0}"

# ProgressPage_ProgressDownloadEntryText
source: Downloading "{0}"
ru_ru: Загрузка "{0}" с сетевого ресурса

# ProgressPage_ProgressExecuteEntryText
source: Installing "{0}"
ru_ru: Установка "{0}"

# ProgressPage_ProgressExtractEntryText
source: Extracting "{0}"
ru_ru: Распаковка "{0}"

# ProgressPage_RemovingTextMain
source: Removing WixWPFWizardBA.
ru_ru: Удаление WixWPFWizardBA.

# ProgressPage_RepairingTextMain
source: Repairing WixWPFWizardBA.
ru_ru: Починка WixWPFWizardBA.

# ProgressPage_TotalProgressText
source: Total progress: {0}%
ru_ru: Общий прогресс: {0}%

# ProgressPage_UpdatingTextLine2
source: We recommend that you visit the website and check out what's new.
ru_ru: Рекомендуем зайти на сайт программы и почитать, о том что поменялось!

# ProgressPage_UpdatingTextMain
source: Updating WixWPFWizardBA.
ru_ru: Идет обновление WixWPFWizardBA.

# WelcomePage_AddComponentsButtonText
source: Add components
ru_ru: Добавить установленные компоненты

# WelcomePage_InstallButtonText
source: Install
ru_ru: Установить

# WelcomePage_LayoutButtonText
source: Create an offline installer
ru_ru: Создать установщик для установки без интернета

# WelcomePage_RepairButtonText
source: Repair
ru_ru: Починить

# WelcomePage_UninstallButtonText
source: Remove
ru_ru: Удалить

# WelcomePage_UpdateButtonText
source: Update
ru_ru: Обновить

# WelcomePage_WelcomeText
source: Welcome to the graphical installer for {0}!
ru_ru: Вас приветствует мастер установки {0}!

# Wizard_BackButtonText
source: Back
ru_ru: Назад

# Wizard_CancelButtonText
source: Cancel
ru_ru: Отменить

# Wizard_HeaderCreatingOfflineInstaller
source: {0} - Creating offline installer
ru_ru: Подготовка к установке {0}

# Wizard_HeaderInstalling
source: Installing {0}
ru_ru: Установка {0}

# Wizard_HeaderModifying
source: Modifying {0}
ru_ru: Установка компонентов {0}

# Wizard_HeaderRemoving
source: Removing {0}
ru_ru: Удаление {0}

# Wizard_HeaderRepairing
source: Repairing {0}
ru_ru: Починка {0}

# Wizard_NextButtonText
source: Next
ru_ru: Далее

# Wizard_WindowTitle
source: {0} - Setup {1}
ru_ru: {0} - Установщик {1}
